<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"1304bf322987c8fa3606f5ccb05292c036d17ab712dfc3c873d102f1052e0a6d","plan_job_ref":"Job Test actions using target and replace #446 at https://github.com/dflook/terraform-github-actions/actions/runs/12537443304","plan_out_hash":"c5b14eaa717b33ad6698a98beddac94b62e7b30e4ed666f81d60d07af32a1719","plan_hash":"6af397eeee62b94d5b22a16503b1e37f19100d8aefba6548ad61363557007ae4","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "Rq6s1pk3me" -> (known after apply)
!~  foreach = "RdIJW0VdYq" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #446](https://github.com/dflook/terraform-github-actions/actions/runs/12537443304)